README.org

* Proof of qualification repo
    :PROPERTIES:
    :header-args: :var DBPATH="server/src/db"
    :END:
  This project aim to proof knowledge of NodeJs/React stack
** Start Scripts
   See [[file:package.json][server package.json]] and [[file:client/package.json][client package.json]] "scripts" sections for details.


Start local infrastructure 
#+begin_src sh
docker-compose up -d
#+end_src
  
Start dev server and client code watchers 
#+begin_src sh
yarn dev:all
#+end_src

Starts server separately
#+begin_src sh
yarn nodemon
#+end_src

Run test in watch mode
#+begin_src sh
yarn test --watch
#+end_src

Executes server side code watcher in dev mode.
** React(Hooks) front-end
*** TODO [7/9] List:
    1. [X] Use React Hooks for state management
    2. [X] Use [[https://ant.design/components/button/][Ant Design]]  components library
    3. [X] Implement reusable Editable list component for admin dashboard
    4. [ ] Sass styling
    5. [X] Mock api calls while developing
    6. [X] Integrate BE API
    7. [X] Mock api data with faker.js
    8. [X] Unit tests
    9. [ ] Functional(end-to-end) tests with cypress
 
** NodeJs backend
*** TODO [6/8] List
    - [X] CRUD actions
    - [X] ES6 syntax for server side code
    - [X] Request validation/sanitation
      - [X] Single route validation
      - [X] Custom validation middleware
    - [X] Error handling
    - [ ] Unit tests
    - [X] End-to-end API testing
      - [X] Scripts for reseting/seeding database with test data
      - [X] Run docker localstack image before tests
      - [X] Wtite end-to-end tests
    - [X] Migrate app to DynamoDB as main DB
    - [ ] [WAITING] Deploy to AWS lambda (localstack)

*** DynamoDB
**** Create and seed with data tables
***** Accounts table
****** Create accounts table
       Generate json shema for DynamoDB table:
    #+begin_src sh :results output :eval never-export :exports both
      aws dynamodb create-table --generate-cli-skeleton > ./server/db/table-shema-example.json
    #+end_src

    #+NAME: delete-accounts-table
    #+begin_src sh :results silent :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb delete-table \
         --table-name Accounts
    #+end_src

    #+NAME: create-table
    #+begin_src sh :results output :wrap json :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb create-table \
         --cli-input-json file://${DBPATH}/AccountsSchema.json
    #+end_src

    #+RESULTS: create-table
    #+begin_json
    {
        "TableDescription": {
            "TableArn": "arn:aws:dynamodb:us-east-1:000000000000:table/Accounts", 
            "AttributeDefinitions": [
                {
                    "AttributeName": "id", 
                    "AttributeType": "S"
                }, 
                {
                    "AttributeName": "accType", 
                    "AttributeType": "S"
                }, 
                {
                    "AttributeName": "createdDateTime", 
                    "AttributeType": "N"
                }
            ], 
            "GlobalSecondaryIndexes": [
                {
                    "IndexSizeBytes": 0, 
                    "IndexName": "accType", 
                    "Projection": {
                        "ProjectionType": "ALL"
                    }, 
                    "ProvisionedThroughput": {
                        "WriteCapacityUnits": 1, 
                        "ReadCapacityUnits": 1
                    }, 
                    "IndexStatus": "ACTIVE", 
                    "KeySchema": [
                        {
                            "KeyType": "HASH", 
                            "AttributeName": "accType"
                        }, 
                        {
                            "KeyType": "RANGE", 
                            "AttributeName": "createdDateTime"
                        }
                    ], 
                    "IndexArn": "arn:aws:dynamodb:ddblocal:000000000000:table/Accounts/index/accType", 
                    "ItemCount": 0
                }
            ], 
            "ProvisionedThroughput": {
                "NumberOfDecreasesToday": 0, 
                "WriteCapacityUnits": 1, 
                "LastIncreaseDateTime": 0.0, 
                "ReadCapacityUnits": 1, 
                "LastDecreaseDateTime": 0.0
            }, 
            "TableSizeBytes": 0, 
            "TableName": "Accounts", 
            "BillingModeSummary": {
                "LastUpdateToPayPerRequestDateTime": 0.0, 
                "BillingMode": "PROVISIONED"
            }, 
            "TableStatus": "ACTIVE", 
            "KeySchema": [
                {
                    "KeyType": "HASH", 
                    "AttributeName": "id"
                }, 
                {
                    "KeyType": "RANGE", 
                    "AttributeName": "createdDateTime"
                }
            ], 
            "ItemCount": 0, 
            "CreationDateTime": 1585242674.111
        }
    }
    #+end_json


    #+RESULTS: create-tabl
   #+begin_src sh :results output org :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb list-tables
   #+end_src

   #+RESULTS:
   #+begin_src org
   {
       "TableNames": [
           "Accounts"
       ]
   }
   #+end_src
****** Seed accounts with test data

  #NAME: seed-accounts
  #+begin_src sh :results output :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb batch-write-item \
         --request-items   \
         file://${DBPATH}/AccountsDataSeed.json
  #+end_src

  #+RESULTS:
  : {
  :     "UnprocessedItems": {}
  : }

  Unfortunately =batch-write-item= limited to 25 operations
****** Quering single item

 #NAME: query-account-by-type
 #+begin_src sh :results output :eval never-export :exports both
   aws --endpoint-url http://localhost:4569 \
     dynamodb query \
     --table-name Accounts \
     --key-condition-expression "id = :id" \
     --expression-attribute-values  '{":id":{"S": "d83ef3c0-6d35-11ea-9d77-3dffd7d18939"}}'
 #+end_src

 #+RESULTS:
 #+begin_example json
 {
     "Count": 1, 
     "Items": [
         {
             "comment": {
                 "S": "Facere deleniti blanditiis eum."
             }, 
             "category": {
                 "S": "Sales"
             }, 
             "createdDateTime": {
                 "N": "1446960934025"
             }, 
             "accType": {
                 "S": "default"
             }, 
             "vatPercent": {
                 "N": "49"
             }, 
             "accName": {
                 "S": "Roi Greens Backing Up"
             }, 
             "vatCategoryS": {
                 "S": "S"
             }, 
             "id": {
                 "S": "d83ef3c0-6d35-11ea-9d77-3dffd7d18939"
             }, 
             "accNo": {
                 "N": "55"
             }
         }
     ], 
     "ScannedCount": 1, 
     "ConsumedCapacity": null
 }
 #+end_example
