README.md
- [Proof of qualification repo](#sec-1)
  - [Start Scripts](#sec-1-1)
  - [React(Hooks) front-end](#sec-1-2)
    - [<code>[7/9]</code> List:](#sec-1-2-1)
  - [NodeJs backend](#sec-1-3)
    - [<code>[6/8]</code> List](#sec-1-3-1)
    - [DynamoDB](#sec-1-3-2)
    - [API docs](#sec-1-3-3)

# Proof of qualification repo<a id="sec-1"></a>

This project aim to proof knowledge of NodeJs/React stack

## Start Scripts<a id="sec-1-1"></a>

See [server package.json](package.json) and [client package.json](client/package.json) "scripts" sections for details.

Start local infrastructure

```sh
docker-compose up -d
```

Start dev server and client code watchers

```sh
yarn dev:all
```

Starts server separately

```sh
yarn nodemon
```

Run test in watch mode

```sh
yarn test --watch
```

Executes server side code watcher in dev mode.

## React(Hooks) front-end<a id="sec-1-2"></a>

### TODO <code>[7/9]</code> List:<a id="sec-1-2-1"></a>

1.  [X] Use React Hooks for state management
2.  [X] Use [Ant Design](https://ant.design/components/button/) components library
3.  [X] Implement reusable Editable list component for admin dashboard
4.  [ ] Sass styling
5.  [X] Mock api calls while developing
6.  [X] Integrate BE API
7.  [X] Mock api data with faker.js
8.  [X] Unit tests
9.  [ ] Functional(end-to-end) tests with cypress

## NodeJs backend<a id="sec-1-3"></a>

### TODO <code>[6/8]</code> List<a id="sec-1-3-1"></a>

-   [X] CRUD actions
-   [X] ES6 syntax for server side code
-   [X] Request validation/sanitation
    -   [X] Single route validation
    -   [X] Custom validation middleware
-   [X] Error handling
-   [ ] Unit tests
-   [X] End-to-end API testing
    -   [X] Scripts for reseting/seeding database with test data
    -   [X] Run docker localstack image before tests
    -   [X] Wtite end-to-end tests
-   [X] Migrate app to DynamoDB as main DB
-   [ ] [WAITING] Deploy to AWS lambda (localstack)

### DynamoDB<a id="sec-1-3-2"></a>

1.  Create and seed with data tables

    1.  Accounts table
    
        1.  Create accounts table
        
            Generate json shema for DynamoDB table:
            
            ```sh
            aws dynamodb create-table --generate-cli-skeleton > ./server/db/table-shema-example.json
            ```
            
            ```sh
            aws --endpoint-url http://localhost:4569 \
                dynamodb delete-table \
                --table-name Accounts
            ```
            
            ```sh
            aws --endpoint-url http://localhost:4569 \
                dynamodb create-table \
                --cli-input-json file://${DBPATH}/AccountsSchema.json
            ```
            
            <div class="json">
            { "TableDescription": { "TableArn": "arn:aws:dynamodb:us-east-1:000000000000:table/Accounts", "AttributeDefinitions": [ { "AttributeName": "id", "AttributeType": "S" }, { "AttributeName": "accType", "AttributeType": "S" }, { "AttributeName": "createdDateTime", "AttributeType": "N" } ], "GlobalSecondaryIndexes": [ { "IndexSizeBytes": 0, "IndexName": "accType", "Projection": { "ProjectionType": "ALL" }, "ProvisionedThroughput": { "WriteCapacityUnits": 1, "ReadCapacityUnits": 1 }, "IndexStatus": "ACTIVE", "KeySchema": [ { "KeyType": "HASH", "AttributeName": "accType" }, { "KeyType": "RANGE", "AttributeName": "createdDateTime" } ], "IndexArn": "arn:aws:dynamodb:ddblocal:000000000000:table/Accounts/index/accType", "ItemCount": 0 } ], "ProvisionedThroughput": { "NumberOfDecreasesToday": 0, "WriteCapacityUnits": 1, "LastIncreaseDateTime": 0.0, "ReadCapacityUnits": 1, "LastDecreaseDateTime": 0.0 }, "TableSizeBytes": 0, "TableName": "Accounts", "BillingModeSummary": { "LastUpdateToPayPerRequestDateTime": 0.0, "BillingMode": "PROVISIONED" }, "TableStatus": "ACTIVE", "KeySchema": [ { "KeyType": "HASH", "AttributeName": "id" }, { "KeyType": "RANGE", "AttributeName": "createdDateTime" } ], "ItemCount": 0, "CreationDateTime": 1585242674.111 } }
            
            </div>
            
            ```sh
            aws --endpoint-url http://localhost:4569 \
                dynamodb list-tables
            ```
            
            ```org
            {
                "TableNames": [
                    "Accounts"
                ]
            }
            ```
        
        2.  Seed accounts with test data
        
            \#NAME: seed-accounts
            
            ```sh
            aws --endpoint-url http://localhost:4569 \
                dynamodb batch-write-item \
                --request-items   \
                file://${DBPATH}/AccountsDataSeed.json
            ```
            
                {
                    "UnprocessedItems": {}
                }
            
            Unfortunately `batch-write-item` limited to 25 operations
        
        3.  Quering single item
        
            \#NAME: query-account-by-type
            
            ```sh
            aws --endpoint-url http://localhost:4569 \
              dynamodb query \
              --table-name Accounts \
              --key-condition-expression "id = :id" \
              --expression-attribute-values  '{":id":{"S": "d83ef3c0-6d35-11ea-9d77-3dffd7d18939"}}'
            ```
            
                {
                    "Count": 1, 
                    "Items": [
                        {
                            "comment": {
                                "S": "Facere deleniti blanditiis eum."
                            }, 
                            "category": {
                                "S": "Sales"
                            }, 
                            "createdDateTime": {
                                "N": "1446960934025"
                            }, 
                            "accType": {
                                "S": "default"
                            }, 
                            "vatPercent": {
                                "N": "49"
                            }, 
                            "accName": {
                                "S": "Roi Greens Backing Up"
                            }, 
                            "vatCategoryS": {
                                "S": "S"
                            }, 
                            "id": {
                                "S": "d83ef3c0-6d35-11ea-9d77-3dffd7d18939"
                            }, 
                            "accNo": {
                                "N": "55"
                            }
                        }
                    ], 
                    "ScannedCount": 1, 
                    "ConsumedCapacity": null
                }
