README.org
****** Querying accounts from GSI
 #NAME: query-account-by-type
 #+begin_src sh :results output :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb query \
        --table-name Accounts \
        --index-name accType \
        --key-condition-expression "accType = :accType" \
        --expression-attribute-values  '{":accType":{"S":"bookkeeping"}}'
 #+end_src

 #+RESULTS:
 #+begin_example
 {
     "Count": 3, 
     "Items": [
         {
             "comment": {
                 "S": "est autem facere"
             }, 
             "category": {
                 "S": "Purchase"
             }, 
             "createdDateTime": {
                 "N": "1329262892304"
             }, 
             "accType": {
                 "S": "bookkeeping"
             }, 
             "vatPercent": {
                 "N": "73"
             }, 
             "accName": {
                 "S": "Agp"
             }, 
             "vatCategoryS": {
                 "S": "P"
             }, 
             "id": {
                 "S": "d83fde20-6d35-11ea-9d77-3dffd7d18939"
             }, 
             "accNo": {
                 "N": "93"
             }
         }, 
         {
             "comment": {
                 "S": "Amet consequatur similique quis nobis nam maxime ut dolor. Vitae sed quo sunt molestias vero tempore minima. Necessitatibus ducimus hic reprehenderit. Hic dolore error animi ut aperiam. Hic inventore sunt ipsa ut recusandae. Sed accusantium et iusto.\n \rUnde neque sequi quidem beatae. Quo repudiandae voluptatem impedit nostrum asperiores nostrum aut magnam odio. At recusandae dolorem sunt debitis sequi totam esse ipsa. Eos repellendus totam aut hic.\n \rConsequatur voluptate sunt ratione est est ad omnis. Debitis animi ut est consequatur. Quos praesentium autem est minus et ea."
             }, 
             "category": {
                 "S": "Purchase"
             }, 
             "createdDateTime": {
                 "N": "1551172226477"
             }, 
             "accType": {
                 "S": "bookkeeping"
             }, 
             "vatPercent": {
                 "N": "22"
             }, 
             "accName": {
                 "S": "Computer Manat Vanuatu"
             }, 
             "vatCategoryS": {
                 "S": "P"
             }, 
             "id": {
                 "S": "d83f41e0-6d35-11ea-9d77-3dffd7d18939"
             }, 
             "accNo": {
                 "N": "66"
             }
         }, 
         {
             "category": {
                 "S": "Purchase"
             }, 
             "createdDateTime": {
                 "N": "1564661196514"
             }, 
             "accType": {
                 "S": "bookkeeping"
             }, 
             "vatPercent": {
                 "N": "88"
             }, 
             "accName": {
                 "S": "Maroon Refined Granite Tuna"
             }, 
             "vatCategoryS": {
                 "S": "P"
             }, 
             "id": {
                 "S": "d83fb710-6d35-11ea-9d77-3dffd7d18939"
             }, 
             "accNo": {
                 "N": "93"
             }
         }
     ], 
     "ScannedCount": 3, 
     "ConsumedCapacity": null
 }
 #+end_example

 Because =createdDateTime= was used as =RANGE= (sorted) key, list of items returned by this query
 sorted descendant by =createdDateTime=

***** Contractors table
****** Create table
    #+NAME: delete-contractors-table
    #+begin_src sh :results silent :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb delete-table \
         --table-name Contractors
    #+end_src

    #+NAME: create-contractors-table
    #+begin_src sh :results output org :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb create-table \
         --cli-input-json file://${DBPATH}/ContractorsSchema.json
    #+end_src

    #+RESULTS: create-contractors-table
    #+begin_src org
    {
        "TableDescription": {
            "TableArn": "arn:aws:dynamodb:us-east-1:000000000000:table/Contractors", 
            "AttributeDefinitions": [
                {
                    "AttributeName": "id", 
                    "AttributeType": "S"
                }, 
                {
                    "AttributeName": "createdDateTime", 
                    "AttributeType": "N"
                }
            ], 
            "ProvisionedThroughput": {
                "NumberOfDecreasesToday": 0, 
                "WriteCapacityUnits": 1, 
                "LastIncreaseDateTime": 0.0, 
                "ReadCapacityUnits": 1, 
                "LastDecreaseDateTime": 0.0
            }, 
            "TableSizeBytes": 0, 
            "TableName": "Contractors", 
            "BillingModeSummary": {
                "LastUpdateToPayPerRequestDateTime": 0.0, 
                "BillingMode": "PROVISIONED"
            }, 
            "TableStatus": "ACTIVE", 
            "KeySchema": [
                {
                    "KeyType": "HASH", 
                    "AttributeName": "id"
                }, 
                {
                    "KeyType": "RANGE", 
                    "AttributeName": "createdDateTime"
                }
            ], 
            "ItemCount": 0, 
            "CreationDateTime": 1585223192.602
        }
    }
    #+end_src

   #+begin_src sh :results output org :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb list-tables
   #+end_src

   #+RESULTS:
   #+begin_src org
   {
       "TableNames": [
           "Accounts", 
           "Contractors"
       ]
   }
   #+end_src
****** Seed accounts with test data

  #NAME: seed-accounts
  #+begin_src sh :results output :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb batch-write-item \
         --request-items file://${DBPATH}/ContractorsDataSeed.json
  #+end_src

  #+RESULTS:
  : {
  :     "UnprocessedItems": {}
  : }
****** Scan all items

 #NAME: scan-all-items
 #+begin_src sh :results output :eval never-export :exports both
     aws --endpoint-url http://localhost:4569 \
         dynamodb scan \
        --table-name Contractors 
 #+end_src

 #+RESULTS:
 #+begin_example json
 {
     "Count": 25, 
     "Items": [
         {
             "createdDateTime": {"N": "1472427643486"}, 
             "id": {"S": "51c19f64-6d26-11ea-b66b-eddefd31ba92"}
         }, 
         {
             "createdDateTime": {"N": "1405647608992"}, 
             "id": {"S": "51c19f5c-6d26-11ea-b66b-eddefd31ba92"}
         }, 
         ...
     ], 
     "ScannedCount": 25, 
     "ConsumedCapacity": null
 }
 #+end_example

