README.org
**** [WAITING] [4/6] Attempt to create stack from cloud formation config on localstack env
     - [X] Use aws-serverless-express custom server for lambda env
     - [X] Mock aws infrastructure with localstack
     - [X] Refactor express server to be able to run it locally without deployment on lambda
     - [X] Crete cloud formation template for s3 SPA hosting
     - [ ] [Failed] Deploy express app to labmda
           lockalstack problems appear on execution cloud formation template
     - [ ] Decouple client code from beckend code 
     - [ ] API Gatewat setup

  List of cloud formation stacks
  #+NAME: end-point-list
  #+begin_src sh :results output :eval never-export :exports both
    aws --endpoint-url=http://localhost:4581 cloudformation list-stacks
  #+end_src

  #+RESULTS: end-point-list
  : /Users/vladimir/projects/react-examples/rhooks-form-app
  : {
  :     "StackSummaries": []
  : }

  #+begin_src sh :results output :eval never-export :exports both
  aws cloudformation create-stack \
      --template-body file://cloudformation.yml \
      --stack-name web-stack \
      --endpoint-url=http://localhost:4581
  #+end_src

  #+RESULTS:
  : An error occurred (502) when calling the CreateStack operation (reached max retries: 4): Bad Gateway

  Error log from docker:
  #+RESULTS:
  : local_aws     |   File "/opt/code/localstack/.venv/lib/python3.8/site-packages/moto/cloudformation/utils.py", line 61, in yaml_tag_constructor
  : local_aws     |     return {key: _f(loader, tag, node)}
  : local_aws     |   File "/opt/code/localstack/.venv/lib/python3.8/site-packages/moto/cloudformation/utils.py", line 50, in _f
  : local_aws     |     return node.value.split(".")
  : local_aws     | AttributeError: 'list' object has no attribute 'split'
*** API docs
**** Accounts
     :PROPERTIES:
     :header-args: :var API="http://localhost:5000/api"
     :END:
     All accounts tested for "bookkeeping" type
***** [C] Create account
   #+NAME: create-account 
   #+begin_src sh :results verbatim :exports both
     curl -X POST -vs "${API}/accounts?type=bookkeeping&pretty" \
          -H 'Content-Type: application/json' \
          -d '{ "accNo": 111, "category": "Purchase", "vatPercent": 11, "vatCategoryS": "P", "accName": "One one one" }'
  #+end_src

   #+RESULTS: create-account
   : {
   :   "id": "ZmI5N2NiYjAtNmY0NC0xMWVhLTg1ZDQtNWZlNTExZjNjMTJjLDE1ODUyMTUyNjU3NzE%3D",
   :   "accType": "bookkeeping",
   :   "accNo": 111,
   :   "category": "Purchase",
   :   "vatPercent": 11,
   :   "vatCategoryS": "P",
   :   "accName": "One one one"
   : }

****** Invalid request

   #+NAME: create-account-invalid
   #+begin_src sh :results verbatim :exports both
     curl -X POST -vsi "${API}/accounts?type=bookkeeping&pretty" \
          -H 'Content-Type: application/json' \
          -d '{ "category": "Purchase" }'
  #+end_src

  #+RESULTS: create-account-invalid
  #+begin_example
  HTTP/1.1 422 Unprocessable Entity
  X-Powered-By: Express
  Content-Type: application/json; charset=utf-8
  Content-Length: 130
  ETag: W/"82-HHj2rmNjH457Bv9LJ8U88iWD1J8"
  Date: Thu, 26 Mar 2020 09:34:34 GMT
  Connection: keep-alive
  
  {
    "errors": [
      {
        "msg": "account number should be number",
        "param": "accNo",
        "location": "body"
      }
    ]
  }
  #+end_example

***** [R1] Get all accounts 
    #+NAME: get-all-boo-accounts 
    #+begin_src sh :results verbatim :exports both
      curl -vsi "${API}/accounts?type=bookkeeping&pretty"
   #+end_src

   #+RESULTS: get-all-boo-accounts
   #+begin_example
   HTTP/1.1 200 OK
   X-Powered-By: Express
   Content-Type: application/json; charset=utf-8
   Content-Length: 1744
   ETag: W/"6d0-2mL5pUjB/Fv9kynH8T8rgXyF0aA"
   Date: Thu, 26 Mar 2020 09:34:43 GMT
   Connection: keep-alive
   
   {
     "items": [
       {
         "id": "ZDgzZmRlMjAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDEzMjkyNjI4OTIzMDQ%3D",
         "vatCategoryS": "P",
         "accNo": 93,
         "accName": "Agp",
         "comment": "est autem facere",
         "category": "Purchase",
         "accType": "bookkeeping",
         "vatPercent": 73
       },
       {
         "id": "ZDgzZjQxZTAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDE1NTExNzIyMjY0Nzc%3D",
         "vatCategoryS": "P",
         "accNo": 66,
         "accName": "Computer Manat Vanuatu",
         "comment": "Amet consequatur similique quis nobis nam maxime ut dolor. Vitae sed quo sunt molestias vero tempore minima. Necessitatibus ducimus hic reprehenderit. Hic dolore error animi ut aperiam. Hic inventore sunt ipsa ut recusandae. Sed accusantium et iusto.\n \rUnde neque sequi quidem beatae. Quo repudiandae voluptatem impedit nostrum asperiores nostrum aut magnam odio. At recusandae dolorem sunt debitis sequi totam esse ipsa. Eos repellendus totam aut hic.\n \rConsequatur voluptate sunt ratione est est ad omnis. Debitis animi ut est consequatur. Quos praesentium autem est minus et ea.",
         "category": "Purchase",
         "accType": "bookkeeping",
         "vatPercent": 22
       },
       {
         "id": "ZDgzZmI3MTAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDE1NjQ2NjExOTY1MTQ%3D",
         "vatCategoryS": "P",
         "accNo": 93,
         "accName": "Maroon Refined Granite Tuna",
         "category": "Purchase",
         "accType": "bookkeeping",
         "vatPercent": 88
       },
       {
         "id": "ZmI5N2NiYjAtNmY0NC0xMWVhLTg1ZDQtNWZlNTExZjNjMTJjLDE1ODUyMTUyNjU3NzE%3D",
         "vatCategoryS": "P",
         "accNo": 111,
         "accName": "One one one",
         "accType": "bookkeeping",
         "category": "Purchase",
         "vatPercent": 11
       }
     ],
     "count": 4
   }
   #+end_example

***** [R2] Get single account  
    #+NAME: get-one-boo-accounts 
    #+begin_src sh :results verbatim :exports both
      curl -vsi "${API}/accounts/ZDgzZWYzYzAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDE0NDY5NjA5MzQwMjU%3D/?pretty"
   #+end_src

   #+RESULTS: get-one-boo-accounts
   #+begin_example
   HTTP/1.1 200 OK
   X-Powered-By: Express
   Content-Type: application/json; charset=utf-8
   Content-Length: 275
   ETag: W/"113-8G/9TPw6G+iF1N4VS0htAw7+rJ8"
   Date: Thu, 26 Mar 2020 09:46:09 GMT
   Connection: keep-alive
   
   {
     "id": "ZDgzZWYzYzAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDE0NDY5NjA5MzQwMjU%3D",
     "vatCategoryS": "S",
     "accNo": 55,
     "accName": "Roi Greens Backing Up",
     "comment": "Facere deleniti blanditiis eum.",
     "category": "Sales",
     "accType": "default",
     "vatPercent": 49
   }
   #+end_example
***** [U] Update account
   #+NAME: update-account 
   #+begin_src sh :results verbatim :exports both
     curl -X PUT -vs "${API}/accounts/ZDgzZWYzYzAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDE0NDY5NjA5MzQwMjU%3D/?pretty" \
          -H 'Content-Type: application/json' \
          -d '{ "vatPercent": 111, "accName": "One One One" }'
  #+end_src

  #+RESULTS: update-account
  #+begin_example
  {
    "id": "ZDgzZWYzYzAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDE0NDY5NjA5MzQwMjU%3D",
    "vatCategoryS": "S",
    "accNo": 55,
    "accName": "One One One",
    "comment": "Facere deleniti blanditiis eum.",
    "category": "Sales",
    "accType": "default",
    "vatPercent": 111
  }
  #+end_example

