README.md
                <meta charset="utf-8">
                <title>Error</title>
                </head>
                <body>
                <pre>Cannot PUT /api/accounts/</pre>
                </body>
                </html>
    
    5.  [D] Delete account
    
        ```sh
        curl -X DELETE -vs "${API}/accounts/ZDgzZWYzYzAtNmQzNS0xMWVhLTlkNzctM2RmZmQ3ZDE4OTM5LDE0NDY5NjA5MzQwMjU%3D/?pretty"
        ```
